[
  {
    "id": 18,
    "displayName": "Anbahnung und Organisation",
    "subMenuEntries": [
      {
        "id": 37,
        "displayName": "Projektauftrag",
        "infoText": "Der Projektauftrag ist das zentrale Produkt zur Genehmigung eines Projekts und in diesem Sinne für jedes Projekt zu erstellen. Durch ihn wird das Projekt formal eingerichtet. Der Projektauftrag definiert, was im Projekt getan werden soll, wer beteiligt ist und wie vorgegangen werden soll. Dazu legt der Projektauftrag bereits die grobe Projektorganisation fest, besetzt die zentralen Projektrollen und skizziert den Projektplan, soweit es zu Projektbeginn schon möglich und sinnvoll ist. Er beschreibt außerdem, warum das Projekt nützlich und wirtschaftlich ist und zählt mögliche Risiken sowie Chancen auf, die den Projektverlauf negativ oder positiv beeinflussen können.",
        "selectable": true
      },
      {
        "id": 38,
        "displayName": "Projekthandbuch",
        "infoText": "Das V-Modell ist ein generischer Vorgehensstandard, der für ein konkretes Projekt angepasst und konkretisiert werden muss. Das Projekthandbuch legt die für Management und Entwicklung notwendigen Anpassungen und Ausgestaltungen fest. Somit dokumentiert es Art und Umfang der Anwendung des V-Modells im Projekt und ist Informationsquelle und Richtlinie für alle Projektbeteiligten.\nDas Projekthandbuch beinhaltet eine Kurzbeschreibung des Projekts, die Beschreibung des Tailoring-Ergebnisses, den grundlegenden Projektdurchführungsplan, die notwendige und vereinbarte Unterstützung des Auftraggebers sowie Organisation und Vorgaben für die Planung und Durchführung des Projekts und die anstehenden Entwicklungsaufgaben. Der Projektleiter muss dieses zentrale Produkt in Abstimmung mit den Schlüsselpersonen des Projekts erarbeiten. ...",
        "selectable": true,
        "chapters": [
          {
            "id": 45,
            "displayName": "Projektüberblick, Projektziele und Erfolgsfaktoren",
            "infoText": "Das Projekthandbuch ist eine unverzichtbare Informationsquelle und Richtlinie für alle Projektbeteiligten. In diesem Thema wird kurz, prägnant und möglichst plastisch das gemeinsame Projektleitbild dargestellt."
          },
          {
            "id": 47,
            "displayName": "Projektspezifisches V-Modell",
            "infoText": "..."
          },
          {
            "id": 48,
            "displayName": "Abweichungen vom V-Modell",
            "infoText": "Sämtliche Abweichungen von den Vorgaben des V-Modells, wie Streichungen einzelner Produkte, Aktivitäten und Abweichung vom Tailoring-Verfahren, müssen unter Angabe von Gründen dokumentiert werden. Die Änderungen sind in diesem Thema aufzuführen."
          },
          {
            "id": 49,
            "displayName": "Projektdurchführungsplan",
            "infoText": "Das V-Modell macht durch die Festlegung von Entscheidungspunkten Vorgaben zur groben Strukturierung des Projekts. Dieses Thema enthält die planerische Ausgestaltung dieser Entscheidungspunkte in Form eines Projektdurchführungsplans. Hierbei sind zumindest der Projektanfang, das Projektende und alle wichtigen Entscheidungspunkte während des Projekts einzuplanen. Es muss dokumentiert werden, welche Produkte für das Herbeibeiführen einer Projektfortschrittsentscheidung, also dem Erreichen eines Entscheidungspunktes erforderlich sind.\nDarüber hinaus können noch weitere projektspezifische Meilensteine festgelegt werden, soweit diese für alle Projektbeteiligten relevant sind. Meilensteine, die nur projektintern relevant sind, werden im Projektplan dokumentiert."
          },
          {
            "id": 50,
            "displayName": "Organisation und Vorgaben zur Vergabe von Entwicklungsleistungen",
            "infoText": "In diesem Thema ist der Vergabeprozess bis hin zur Beauftragung des Auftragnehmers zu dokumentieren. Es muss festgelegt werden, welche Produkte dabei relevant sind und nach welchen Regelungen und Vorgaben diese erstellt werden.\nNeben einem Prozess zur Vorbereitung und Veröffentlichung der Ausschreibung ist festzuhalten, wie die Bewertung der eingegangenen Angebote und letztlich die Zuschlagserteilung erfolgen.\nSoll die Entwicklung informationssicherheitskritischer Systeme nur an Bieter vergeben werden, die entsprechende Zertifizierungen vorweisen können, müssen hier alle relevanten Zertifikate (z.B. BSI, ISO 270xx) aufgeführt werden, die der Bieter im Rahmen des Angebots vorweisen muss."
          },
          {
            "id": 52,
            "displayName": "Organisation und Vorgaben zum Projektmanagement",
            "infoText": "..."
          },
          {
            "id": 53,
            "displayName": "Organisation und Vorgaben zum Risikomanagement",
            "infoText": "Damit die Einschätzungen der Risiken innerhalb des Projekts nach denselben Maßstäben erfolgen, wird das im V-Modell bereits vorgesehene Risikomanagement in diesem Thema ausgestaltet und konkretisiert. Dabei ist die generelle Entscheidung zu treffen, ob neben Risiken auch Chancen betrachtet werden sollen. Für Chancen wird das gleiche Verfahren wie für Risiken angewendet, deshalb wird im Folgenden nicht mehr zwischen den Begriffen Chance und Risiko unterschieden.\nHier erfolgt die Festlegung, wann und nach welchen Kriterien Risiken in einer Risikoliste dokumentiert werden. Zusätzlich muss definiert werden, mit welchen Methoden, Richtlinien und Standards und mit welchen Werkzeugen das Risikomanagement durchzuführen ist.\nDabei sind im Einzelnen die folgenden Punkte festzulegen:\nRisikoklassen zur Einstufung von Risiken\nKriterien zur Risikoakzeptanz\nEskalationsstufen basierend auf den definierten Risikoklassen, entsprechend den Vorgaben des Themas Organisation und Vorgaben zum Projektmanagement\nVerfahren für die Dokumentation der identifizierten Risiken und der geplanten Maßnahmen\nZeitpunkte und Vorgehen bei der Risikoidentifizierung\nZeitpunkte für die Neubewertung von Risiken\nZeitpunkte und Verfahren für die Planung und Durchführung von Gegenmaßnahmen"
          },
          {
            "id": 54,
            "displayName": "Organisation und Vorgaben zum Problem- und Änderungsmanagement",
            "infoText": "In diesem Thema wird das im V-Modell bereits vorgesehene Problem- und Änderungsmanagement ausgestaltet und konkretisiert. Es erfolgt die Festlegung, ob, wann und welche Problemmeldungen und Änderungsanträge erstellt werden müssen, nach welchen Methoden, Richtlinien und Standards diese zu bearbeiten sind und mit welchen Werkzeugen sie weiterverarbeitet werden.\nDies beinhaltet beispielsweise die Definition der vorgesehenen Status von Problemmeldungen und Änderungsanträgen (erstellt, genehmigt und abgelehnt) die Besetzung der Änderungssteuerungsgruppe (Change Control Board) sowie das Konfliktmanagement und die Eskalationsstrategie. Dabei kann es erforderlich sein, mehrere Änderungsverantwortliche und Änderungssteuerungsgruppen (Change Control Boards) mit unterschiedlicher Entscheidungskompetenz und Zusammensetzung einzurichten.\nBei unterschiedlichen Auffassungen in einer Änderungssteuerungsgruppe (Change Control Board) werden Eskalationsstufen definiert. Beispielsweise kann eine mit größerer Entscheidungskompetenz ausgestattete Änderungssteuerungsgruppe (Change Control Board) oder ein Lenkungsausschuss als Eskalationsinstanz festgelegt werden.",
            "articles": [
              {
                "id": 69,
                "type": "sample",
                "displayName": "Einbindung in das ISMS",
                "infoText": "Einbindung in das ISMS\nProblemmeldungen und Änderungsanträge werden in <Werkzeugname> erfasst. <Werkzeugname> ist unter <URL> zu erreichen.\n<Werkzeugname> wird vom Informationssicherheitsbeauftragten (Organisation) in <ISMS-Werkzeugname> unter <Pfad im ISMS-Werkzeug> geführt und den dort festgelegten Sicherheitsvorgaben entsprechend vom IT-Betrieb bereitgestellt. Für das Projekt bedeutet dies insbesondere:\nAnmelden können sich nur Personen, die in <Benutzerverwaltung, z.B. ActiveDirectory> hinterlegt und <Werkzeugname> in einer der Rollen <Entwickler, Tester, Administrator, ...> zugeordnet sind.\n<...>"
              }
            ]
          },
          {
            "id": 55,
            "displayName": "Organisation und Vorgaben zum Konfigurationsmanagement",
            "infoText": "...",
            "articles": [
              {
                "id": 71,
                "type": "sample",
                "displayName": "Einbindung in das ISMS",
                "infoText": "Einbindung in das ISMS\nIm Projekt erarbeitete Produkte und für das Projekt relevante externe Produkte werden im Projekt-Repository in <Werkzeugname (Produktbibliothek)> abgelegt. <Werkzeugname> ist unter <URL> zu erreichen.\n<Werkzeugname> wird vom Informationssicherheitsbeauftragten (Organisation) in <ISMS-Werkzeugname> unter <Pfad im ISMS-Werkzeug> geführt und den dort festgelegten Sicherheitsvorgaben entsprechend vom IT-Betrieb bereitgestellt. Für das Projekt bedeutet dies insbesondere:\nAnmelden können sich nur Personen, die in <Benutzerverwaltung, z.B. ActiveDirectory> hinterlegt und <Werkzeugname> in einer der Rollen <Entwickler, Tester, Administrator, ...> zugeordnet sind.\nLokale Arbeitsstände müssen unverzüglich, spätestens am Ende eines Arbeitstages in <Werkzeugname> gesichert werden.\n<...>"
              },
              {
                "id": 72,
                "type": "sample",
                "displayName": "Identifikation von Dokumenten in der Ablagestruktur",
                "infoText": "Identifikation von Dokumenten in der Ablagestruktur\nDie Identifikation der Dokumente erfolgt über ihren Ablagepfad in der Hierarchie der Produktbibliothek. Eine zusätzliche Vergabe numerischer Dokumenten-IDs ist nicht vorgesehen. Der Ablagepfad enthält die Informationen über das Verzeichnis und den Dateinamen des Produktes innerhalb der Produktbibliothek,\nz. B. bezeichnet\n„{PROJEKTNAME}\\(optionaler Pfad)\\Planung und Steuerung\\Projekthandbuch.doc“\ndas vorliegende Projekthandbuch. Der Ablagepfad wird auf dem Deckblatt jedes Produktes ausgewiesen."
              },
              {
                "id": 73,
                "type": "sample",
                "displayName": "Namenskonventionen nach ISO",
                "infoText": "Namenskonventionen nach ISO\nFür alle Produkte, die zu einem bestimmten Datum erstellt wurden und nicht mehr fortgeschrieben, werden gilt die Konvention: „ISO-Datum Produktbezeichnung“ (Wobei das ISO-Datum durch das jeweilige Erstellungsdatum zu ersetzen ist). Ein Protokoll eines Arbeitstreffens wird damit beispielsweise unter dem Namen „20050310 Protokoll Arbeitstreffen.doc“ abgelegt.\nAnalog gilt diese Regelung für Verzeichnisse, deren Inhalte zu einem bestimmten Zeitpunkt erstellt und nicht mehr geändert werden. Laufend fortgeschriebene Produkte, wie z.B. das Projekthandbuch, werden unter Angabe der Versionsnummer hinter dem jeweiligen Namen gespeichert (z.B. „20050608 Projekthandbuch V1.6.doc“).\nFür fortzuschreibende Dokumente, die keine Versionsnummer enthalten, ist an das Erstellungsdatum eine fortlaufende 2-stellige Zahl, getrennt durch einen Bindestrich, einzufügen. Bsp.: „20050622-01 DATEINAME.doc“"
              }
            ]
          },
          {
            "id": 57,
            "displayName": "Organisation und Vorgaben zum Anforderungsmanagement",
            "infoText": "In diesem Thema wird das im V-Modell bereits vorgesehene Vorgehen zum Anforderungsmanagement ausgestaltet und konkretisiert. Es erfolgt die Festlegung, wann und welche Produkte für das Anforderungsmanagement zu verwenden sind, nach welchen Methoden, Richtlinien und Standards diese zu erstellen sind und mit welchen Werkzeugen sie zu bearbeiten sind.\nDies beinhaltet beispielsweise die Bestimmung aller Beteiligten am Anforderungsmanagement für die gesamte Projektlaufzeit inklusive der Verantwortlichkeiten, die Definition von möglichen Zuständen wie dem Grad der Abgestimmtheit einer Anforderung, die Festlegung einer Beschreibungsschablone für Anforderungen und eventuell die Festlegung eines Werkzeugs zur Erfassung und Verwaltung von Anforderungen."
          },
          {
            "id": 58,
            "displayName": "Organisation und Vorgaben zum Informationssicherheits-Managementsystem",
            "infoText": "In diesem Thema wird das im V-Modell bereits vorgesehene Konfigurationsmanagement ausgestaltet und konkretisiert. Es erfolgt die Festlegung, welche Produktexemplare wann nach welchen Methoden, Richtlinien und Standards vom Konfigurationsmanagement zu verwalten sind, sowie wann und in welchen Abständen Produktkonfigurationen und Releases zu erstellen sind. Zu Anzahl und Umfang der Produktkonfigurationen sind mindestens die Vorgaben zum Konfigurationsmanagement (siehe auch Produktmodell) einzuhalten.\nAlle Produkte, die im Rahmen eines V-Modell Projektes erstellt werden, werden entsprechend den Vorgaben im Projekthandbuch in die Produktbibliothek eingestellt und verwaltet. Hierzu muss festgelegt werden, welche Dateiablagestruktur und Namenskonventionen in der Produktbibliothek einzuhalten sind, wie die Produkte im Konfigurationsmanagement eindeutig zu bezeichnen sind, wie die Fortschreibung von Versionen und Releases erfolgt und welche Produktzustände ein Produktexemplar aus Sicht des Konfigurationsmanagements durchläuft. Die Produktzustände müssen mindestens die im Kapitel Produktprüfung und inhaltliche Produktabhängigkeiten definierten Zustände umfassen.\nNeben der Verwaltung der Produktbibliothek ist im Rahmen dieses Themas ein Konzept zur Datensicherung und Archivierung der Exemplare in der Produktbibliothek zu erstellen. Es werden die Verantwortlichkeiten, Termine und Verfahren zur Datensicherung festgelegt, sowie Konzepte zur Archivierung und Aufbewahrung der Daten über längere Zeiträume erstellt.\nDas Konfigurationsmanagement liefert zudem einen Beitrag zum Projektstatusbericht, welcher zur Fortschrittskontrolle der Produktexemplare und Produktkonfigurationen dient. Es ist festzulegen, wann, in welcher Form und an welche Personen eine KM-Auswertung zu übergeben ist.\nFerner wird in diesem Kapitel beschrieben, wie Eintragungen in das Änderungs- und Prüfverzeichnis von Produkten vorzunehmen sind, d.h. z.B. Häufigkeit von Einträgen und welche Einträge bei der Bearbeitung vorgenommen werden und unter welchen Bedingungen.",
            "articles": [
              {
                "id": 77,
                "type": "sample",
                "displayName": "Allgemeines",
                "infoText": "Allgemeines\nDas Projekt <Projektname> ist als sicherheitskritisch eingestuft (vgl. Kapitel Projektspezifisches V-Modell) und ist daher in das Informationssicherheits-Managementsystem (ISMS) der <Name der Organisation> eingebunden. Die Anwendung des ISMS erstreckt sich auf folgende Abläufe im Projekt: <Anwendungsbereiche>."
              },
              {
                "id": 78,
                "type": "sample",
                "displayName": "Ansprechpartner",
                "infoText": "Ansprechpartner\n\nAnsprechpartner\nVertretung\nISMS Allgemein\n<Kontaktdaten>\n<Kontaktdaten>\nStörungen, Notfälle\n\n\nWartung\n\n\nÄnderung\n\n"
              },
              {
                "id": 79,
                "type": "sample",
                "displayName": "Stakeholder",
                "infoText": "Stakeholder\nFolgende Personen und Gruppen sind grundsätzlich an der Sicherheit des zu entwickelnden Systems interessiert:\nStakeholder\nMaßnahme zur Einbindung\nBetrieb\nRegelmäßige Berichterstattung\n<...>\n<...>"
              },
              {
                "id": 80,
                "type": "sample",
                "displayName": "Dokumentation",
                "infoText": "Dokumentation\nFolgende Dokumente beschreiben die Rahmenbedingungen und Konzepte gemäß den Vorgaben des ISMS:\nInformationssicherheitsleitlinie\nim Intranet: <URL zum Dokument>\nIT-Betriebshandbuch\nim Intranet: <URL zum Dokument>\nIT-Notfallhandbuch\nim Intranet: <URL zum Dokument>\n<...>"
              },
              {
                "id": 81,
                "type": "sample",
                "displayName": "Besonderheiten des Projekts",
                "infoText": "Besonderheiten des Projekts\nFolgende kritische Anwendungen stellen eine Besonderheit des Projekts <Projektname> im Vergleich zu anderen Entwicklungsprojekten der <Name der Organisation> dar.\n<z.B. Mongo Datenbank>\n<...>\nWeitere Besonderheiten betreffen die Projektorganisation sowie die zu verwendenden Kommunikationskanäle:\nEinbindung Auftraggeber über gemeinsames System <z.B. JIRA>\n<...>"
              },
              {
                "id": 82,
                "type": "sample",
                "displayName": "Berichtswesen",
                "infoText": "Berichtswesen\nSiehe Kapitel Berichtswesen und Kommunikationswege."
              },
              {
                "id": 83,
                "type": "sample",
                "displayName": "Besondere Maßnahmen",
                "infoText": "Besondere Maßnahmen\nMit der Durchführung der folgenden Maßnahmen wird auf die besondere Situation des Projekts eingegangen:\n<Maßnahme 1>\n<Maßnahme 2>"
              },
              {
                "id": 84,
                "type": "sample",
                "displayName": "Audits",
                "infoText": "Audits\nAn folgenden Terminen sind Audits zur Überwachung der Sicherheitskonzeption vorgesehen:\n<TT.MM.JJJJ>\nQuartalsweise\nHalbjährlich"
              }
            ]
          }
        ]
      },
      {
        "id": 39,
        "displayName": "Projektvorschlag",
        "infoText": "Der Projektvorschlag ist die Grundlage der Entscheidung darüber, ob ein Projektauftrag erstellt werden soll oder nicht. Die Erstellung erfolgt nicht im Rahmen des V-Modells.\nZweck des Projektvorschlags ist die systematische Darstellung der Informationen und Daten, die deutlich machen, dass die Durchführung eines Projektes notwendig, rentabel und nutzbringend ist.\nAusgehend von einer Projekt- beziehungsweise Systemidee beschreibt der Auftraggeber systematisch die Notwendigkeit eines Projekts. Dies erfolgt unter Berücksichtigung von Machbarkeits-, Finanzierbarkeits-, Markt- und Wirtschaftlichkeitskriterien.\nDer Projektvorschlag bearbeitet Themen wie die Ausgangslage, bestehende Rahmenbedingungen, Projektziele und Systemvorstellungen, Chancen und Risiken sowie die Wirtschaftlichkeit.",
        "selectable": true
      }
    ]
  },
  {
    "id": 19,
    "displayName": "Planung und Steuerung",
    "subMenuEntries": []
  },
  {
    "id": 20,
    "displayName": "Risikomanagement",
    "subMenuEntries": [
      {
        "id": 85,
        "displayName": "Risikoliste",
        "infoText": "Ziel des Risikomanagements ist es, mögliche Risiken im Projekt frühzeitig zu erkennen und auf diese Risiken proaktiv zu reagieren, bevor sie zu einem Problem für das Projekt werden. In der Risikoliste werden die identifizierten Risiken verwaltet und die geplanten Gegenmaßnahmen festgehalten.\nFür die Risikoliste ist der Projektleiter verantwortlich. Zur Bearbeitung greift er auf die notwendigen Projektbeteiligten und gegebenenfalls auf weitere zusätzliche Experten zurück. Die erkannten Risiken und die zugehörigen Gegenmaßnahmen fließen dann wieder in die Projektplanung ein.",
        "selectable": false,
        "chapters": [
          {
            "id": 87,
            "displayName": "Identifizierte Risiken",
            "infoText": "In diesem Thema werden alle identifizierten Risiken mit den im Projekthandbuch geforderten Informationen, wie Status des Risikos und Risikoklasse, aufgelistet."
          },
          {
            "id": 89,
            "displayName": "Maßnahmenplan",
            "infoText": "Den identifizierten Risiken werden die Maßnahmen, die als Reaktion auf das Risiko geplant sind, gegenübergestellt. Für jede Maßnahme sind die im Projekthandbuch geforderten Informationen (wie Art der Maßnahmen, Ereignis, das zur Einleitung der Maßnahme führt, und Verantwortlicher für die Durchführung der Maßnahmen) festzuhalten."
          }
        ],
        "files": [
          {
            "id": 93,
            "displayName": "4Soft: Excel-Risikoliste (GPL)",
            "type": "Excel",
            "url": "http://download.4soft.de/vmxt/blog/Risikoliste.xlsx"
          }
        ]
      }
    ]
  },
  {
    "id": 21,
    "displayName": "Problem- und Änderungsmanagement",
    "subMenuEntries": []
  },
  {
    "id": 22,
    "displayName": "Konfiguarationsmanagement",
    "subMenuEntries": []
  },
  {
    "id": 23,
    "displayName": "Qualitätssicherung",
    "subMenuEntries": []
  },
  {
    "id": 24,
    "displayName": "Messung und Analyse",
    "subMenuEntries": []
  },
  {
    "id": 25,
    "displayName": "Berichtswesen",
    "subMenuEntries": []
  },
  {
    "id": 26,
    "displayName": "Systemelemente",
    "subMenuEntries": []
  },
  {
    "id": 27,
    "displayName": "Systemanalyse",
    "subMenuEntries": []
  },
  {
    "id": 28,
    "displayName": "Systemspezifikation",
    "subMenuEntries": []
  },
  {
    "id": 29,
    "displayName": "Systementwurf",
    "subMenuEntries": []
  },
  {
    "id": 30,
    "displayName": "Logistikelemente",
    "subMenuEntries": []
  },
  {
    "id": 31,
    "displayName": "IT-Organisation und Betrieb",
    "subMenuEntries": []
  },
  {
    "id": 32,
    "displayName": "Ausschreibungswesen (Vergabeakte)",
    "subMenuEntries": []
  },
  {
    "id": 33,
    "displayName": "Vertragswesen",
    "subMenuEntries": []
  },
  {
    "id": 34,
    "displayName": "Angebots- und Auftragswesen",
    "subMenuEntries": []
  },
  {
    "id": 35,
    "displayName": "Lieferung und Abnahme",
    "subMenuEntries": []
  }
]
